<template>
    <div class="container p-0">
        <div class="card-body pt-2 pb-0">
            <div class="row d-flex justify-content-between">
                <div class="col-sm-12 col-md-auto text-center text-md-start py-2">
                    <div class="avatar avatar-xxl mt-n5">
                        <img class="avatar-img rounded-circle border border-white border-3 shadow-sm mb-3"
                            :src="avatarImage" alt="" />
                    </div>
                </div>
                <div
                    class="col-sm-12 col-md text-center text-md-start d-md-flex justify-content-between align-items-center">
                    <div>
                        <p class="text-700 fs-24 fw-semibold mb-0">
                            {{ name }}
                            <span class="text-700 fs-20 fw-medium">({{ nameEnglish }})</span>
                        </p>
                        <ul class="list-inline">
                            <li class="list-inline-item fs-16 text-700">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                        d="M3.36035 7.19979V16.7998C3.36035 17.8602 4.21996 18.7198 5.28035 18.7198H18.7204C19.7808 18.7198 20.6404 17.8602 20.6404 16.7998V7.19979C20.6404 6.1394 19.7808 5.27979 18.7204 5.27979H5.28035C4.21996 5.27979 3.36035 6.1394 3.36035 7.19979Z"
                                        stroke="#726C6C" stroke-linecap="round" stroke-linejoin="round" />
                                    <path d="M14.8799 10.0801H17.7599" stroke="#726C6C" stroke-linecap="round" />
                                    <path d="M14.8799 12.96H17.7599" stroke="#726C6C" stroke-linecap="round" />
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                        d="M11.0402 10.0802C11.0402 11.1406 10.1806 12.0002 9.1202 12.0002C8.05981 12.0002 7.2002 11.1406 7.2002 10.0802C7.2002 9.01977 8.05981 8.16016 9.1202 8.16016C9.62938 8.16016 10.1177 8.36244 10.4778 8.72251C10.8379 9.08258 11.0402 9.57094 11.0402 10.0802Z"
                                        stroke="#726C6C" stroke-linecap="round" stroke-linejoin="round" />
                                    <path d="M5.28027 15.8399C7.95195 12.8284 11.0902 13.7749 12.9603 15.8399"
                                        stroke="#726C6C" stroke-linecap="round" />
                                </svg>
                                {{ student_id }}
                            </li>
                            <li class="list-inline-item fs-16 text-700 ms-2">
                                <svg width="16" height="16" viewBox="0 0 16 16" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                        d="M11.1828 0.482403C11.1446 0.209975 10.9032 0 10.6111 0C10.2925 0 10.0342 0.249888 10.0342 0.55814V1.17524H4.97525V0.55814L4.96999 0.482403C4.93178 0.209975 4.6904 0 4.39833 0C4.07971 0 3.82141 0.249888 3.82141 0.55814V1.18898C1.4562 1.34466 0 2.81536 0 5.18865V11.9233C0 14.4698 1.63195 16 4.24688 16H10.753C13.3711 16 14.9999 14.4954 14.9999 11.9796V5.18865C15.0075 2.81531 13.5569 1.34521 11.188 1.18907V0.55814L11.1828 0.482403ZM10.0342 2.29145V3.00709L10.0394 3.08283C10.0776 3.35526 10.319 3.56523 10.6111 3.56523C10.9297 3.56523 11.188 3.31534 11.188 3.00709V2.30787C12.9124 2.44526 13.8532 3.44182 13.8477 5.18687V5.51025H1.1554V5.18858C1.1554 3.44488 2.10102 2.44624 3.82141 2.30804V3.00709L3.82668 3.08283C3.86488 3.35526 4.10626 3.56523 4.39833 3.56523C4.71696 3.56523 4.97525 3.31534 4.97525 3.00709V2.29145H10.0342ZM1.1554 6.62653V11.9232C1.1554 13.8453 2.26282 14.8837 4.24843 14.8837H10.7546C12.747 14.8837 13.8477 13.867 13.8477 11.9795L13.8477 6.62653H1.1554ZM11.5009 8.97464C11.5009 8.66639 11.2426 8.4165 10.924 8.4165L10.8386 8.4216C10.557 8.45856 10.34 8.69208 10.34 8.97464C10.34 9.2829 10.5983 9.53278 10.924 9.53278L11.0023 9.52769C11.2839 9.49073 11.5009 9.25721 11.5009 8.97464ZM7.51093 8.4165C7.82955 8.4165 8.08785 8.66639 8.08785 8.97464C8.08785 9.25721 7.87081 9.49073 7.58921 9.52769L7.51093 9.53278C7.18518 9.53278 6.92688 9.2829 6.92688 8.97464C6.92688 8.69208 7.14392 8.45856 7.42552 8.4216L7.51093 8.4165ZM4.66561 8.97464C4.66561 8.66639 4.40731 8.4165 4.08869 8.4165L4.00327 8.4216C3.72168 8.45856 3.50464 8.69208 3.50464 8.97464C3.50464 9.2829 3.76293 9.53278 4.08156 9.53278L4.16697 9.52769C4.44857 9.49073 4.66561 9.25721 4.66561 8.97464ZM10.924 11.3091C11.2426 11.3091 11.5009 11.559 11.5009 11.8672C11.5009 12.1498 11.2839 12.3833 11.0023 12.4203L10.924 12.4254C10.5983 12.4254 10.34 12.1755 10.34 11.8672C10.34 11.5847 10.557 11.3511 10.8386 11.3142L10.924 11.3091ZM8.08785 11.8672C8.08785 11.559 7.82955 11.3091 7.51093 11.3091L7.42552 11.3142C7.14392 11.3511 6.92688 11.5847 6.92688 11.8672C6.92688 12.1755 7.18518 12.4254 7.51093 12.4254L7.58921 12.4203C7.87081 12.3833 8.08785 12.1498 8.08785 11.8672ZM4.08869 11.3091C4.40731 11.3091 4.66561 11.559 4.66561 11.8672C4.66561 12.1498 4.44857 12.3833 4.16697 12.4203L4.08156 12.4254C3.76293 12.4254 3.50464 12.1755 3.50464 11.8672C3.50464 11.5847 3.72168 11.3511 4.00327 11.3142L4.08869 11.3091Z"
                                        fill="#726C6C" />
                                </svg>
                               ឆ្នាំទី {{ year }}
                            </li>
                            <li class="list-inline-item fs-20 fs-16 text-700 ms-2">
                                <svg width="22" height="22" viewBox="0 0 22 22" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path d="M11 2.75L0.6875 8.25L11 13.75L21.3125 8.25L11 2.75Z" stroke="#726C6C"
                                        stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round" />
                                    <path
                                        d="M4.8125 10.4502V15.1252C4.8125 16.6377 7.5625 18.5627 11 18.5627C14.4375 18.5627 17.1875 16.6377 17.1875 15.1252V10.4502"
                                        stroke="#726C6C" stroke-miterlimit="10" stroke-linecap="round"
                                        stroke-linejoin="round" />
                                    <path d="M21.3125 8.25V17.1875" stroke="#726C6C" stroke-miterlimit="10"
                                        stroke-linecap="round" stroke-linejoin="round" />
                                </svg>

                                សាកលវិទ្យាល័យ {{ university.name }}
                            </li>
                        </ul>
                    </div>
                    <div class="d-flex align-items-center justify-content-center justify-content-md-end mb-3">
                        <a href="#" class="text-700 fs-20 me-3"><svg width="25" height="25" viewBox="0 0 25 25"
                                fill="none" xmlns="http://www.w3.org/2000/svg">
                                <rect x="0.5625" y="0.890625" width="24" height="24" rx="12" fill="#487DFD" />
                                <path
                                    d="M14.6098 7.9395C15.5207 6.94886 16.9238 6.86855 17.7436 7.76013C18.5634 8.65171 18.4896 10.1775 17.5787 11.1682L16.2592 12.6032M11.806 14.2175C10.9862 13.326 11.06 11.8001 11.9709 10.8095L13.1417 9.53623"
                                    stroke="white" stroke-linecap="round" />
                                <path
                                    d="M14.1332 11.564C15.0555 12.4555 14.9724 13.9814 13.9476 14.972L12.4632 16.407L10.9788 17.842C9.95405 18.8327 8.37564 18.9129 7.45334 18.0214C6.53105 17.1298 6.61413 15.6039 7.6389 14.6133L9.12332 13.1783"
                                    stroke="white" stroke-linecap="round" />
                            </svg>
                        </a>
                        <a :href="fb_name" class="text-700 fs-20 me-3"><svg width="25" height="25" viewBox="0 0 25 25"
                                fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M24.7812 13C24.7812 6.31055 19.3613 0.890625 12.6719 0.890625C5.98242 0.890625 0.5625 6.31055 0.5625 13C0.5625 19.0439 4.99072 24.0537 10.7798 24.9629V16.5005H7.70361V13H10.7798V10.332C10.7798 7.29736 12.5864 5.62109 15.3535 5.62109C16.6787 5.62109 18.0645 5.85742 18.0645 5.85742V8.83594H16.5371C15.0332 8.83594 14.564 9.76953 14.564 10.7271V13H17.9224L17.3853 16.5005H14.564V24.9629C20.353 24.0537 24.7812 19.0439 24.7812 13Z"
                                    fill="#1877FF" />
                            </svg>
                        </a>
                        <a :href="telegram" class="text-700 fs-20"><svg width="25" height="26" viewBox="0 0 25 26" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M12.8906 0.890625C6.20117 0.890625 0.78125 6.31055 0.78125 13C0.78125 19.6895 6.20117 25.1094 12.8906 25.1094C19.5801 25.1094 25 19.6895 25 13C25 6.31055 19.5801 0.890625 12.8906 0.890625ZM18.8379 9.18652L16.8506 18.5518C16.7041 19.2158 16.3086 19.377 15.7568 19.0645L12.7295 16.833L11.2695 18.2393C11.1084 18.4004 10.9717 18.5371 10.6592 18.5371L10.874 15.4561L16.4844 10.3877C16.7285 10.1729 16.4307 10.0508 16.1084 10.2656L9.1748 14.6309L6.18652 13.6982C5.53711 13.4932 5.52246 13.0488 6.32324 12.7363L17.998 8.23437C18.54 8.03906 19.0137 8.36621 18.8379 9.18652Z"
                                    fill="#24A1DE" />
                            </svg>
                        </a>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script setup>
const props = defineProps({
    avatarImage: {
        type: String,
        required: true,
        default: '', 
    },
    name: {
        type: String,
        required: true,
        default: '',
    },
    nameEnglish: {
        type: String,
        required: true,
        default: '',
    },
    student_id: {
        type: Number,
        required: true,
        default: '',
    },
    year: {
        type: String,
        required: true,
        default: '',
    },
    university: {
        type: String,
        required: true,
        default: '',
    },
    fb_name: {
        type: String,
        required: true,
        default: '',
    },
    telegram: {
        type: String,
        required: true,
        default: '',
    },
});

</script>